import numpy as np

A = np.array([
              [0, 1, 1, 1, 0],
              [1, 0, 0, 0, 1],
              [1, 0, 0, 1, 1],
              [1, 0, 1, 0, 1],
              [1, 1, 0, 0, 1],
              [1, 0, 0, 0, 1],
              [0, 1, 1, 1, 0],
])

B = np.array([
              [0, 1, 1, 1, 0],
              [1, 0, 0, 0, 1],
              [1, 0, 0, 0, 1],
              [0, 1, 1, 1, 0],
              [1, 0, 0, 0, 1],
              [1, 0, 0, 0, 1],
              [0, 1, 1, 1, 0],
])

C = np.array([
              [0, 1, 1, 1, 0],
              [1, 0, 0, 0, 1],
              [1, 0, 0, 0, 1],
              [0, 0, 0, 0, 0],
              [1, 0, 0, 0, 1],
              [1, 0, 0, 0, 1],
              [0, 1, 1, 1, 0],
])

D = np.array([
              [0, 1, 1, 1, 0],
              [1, 0, 0, 0, 1],
              [1, 1, 0, 0, 1],
              [1, 1, 1, 1, 1],
              [1, 0, 0, 1, 1],
              [1, 0, 0, 0, 1],
              [0, 1, 1, 1, 0],
])

# sum은 모든 성분의 합
np.sum(D)

# abs는 모든 성분의 절댓값
np.abs(-D)

def H(X,Y):
  return (np.sum(np.abs(X-Y)))


def P(X,Y):
  return(np.sum(X*Y)/np.sum(X))


for i, X in enumerate([A, B, C]):
  print("해밍{}번째\n".format(i), H(X, D), i)
  print("퍼셉트론{}번째\n".format(i), P(X, C), i)